import type { TQuestion } from "~/types/question.type";

export const questions: TQuestion[] = [
    {
        id: 1,
        question: "Πώς μπορώ να κάνω παραγγελία online;",
        answer: "Για να κάνετε παραγγελία online, απλά επισκεφθείτε την ιστοσελίδα μας, επιλέξτε τα προϊόντα που θέλετε και ακολουθήστε τα βήματα για την ολοκλήρωση της παραγγελίας."
    },
    {
        id: 2,
        question: "Ποιες είναι οι διαθέσιμες μέθοδοι πληρωμής;",
        answer: "Δεχόμαστε πληρωμές με πιστωτική/χρεωστική κάρτα, PayPal και αντικαταβολή κατά την παράδοση."
    },
    {
        id: 3,
        question: "Πόσος χρόνος χρειάζεται για την παράδοση;",
        answer: "Ο χρόνος παράδοσης εξαρτάται από την τοποθεσία σας και την ώρα της παραγγελίας, αλλά συνήθως κυμαίνεται μεταξύ 30-60 λεπτών."
    },
    {
        id: 4,
        question: "Μπορώ να κάνω αλλαγές στην παραγγελία μου μετά την υποβολή;",
        answer: "Ναι, μπορείτε να κάνετε αλλαγές στην παραγγελία σας επικοινωνώντας μαζί μας το συντομότερο δυνατό πριν την προγραμματισμένη παράδοση."
    }
];
